{
  "_attn_implementation_autoset": true,
  "_name_or_path": "qanastek/51-languages-classifier",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "af-ZA",
    "1": "am-ET",
    "2": "ar-SA",
    "3": "az-AZ",
    "4": "bn-BD",
    "5": "cy-GB",
    "6": "da-DK",
    "7": "de-DE",
    "8": "el-GR",
    "9": "en-US",
    "10": "es-ES",
    "11": "fa-IR",
    "12": "fi-FI",
    "13": "fr-FR",
    "14": "he-IL",
    "15": "hi-IN",
    "16": "hu-HU",
    "17": "hy-AM",
    "18": "id-ID",
    "19": "is-IS",
    "20": "it-IT",
    "21": "ja-JP",
    "22": "jv-ID",
    "23": "ka-GE",
    "24": "km-KH",
    "25": "kn-IN",
    "26": "ko-KR",
    "27": "lv-LV",
    "28": "ml-IN",
    "29": "mn-MN",
    "30": "ms-MY",
    "31": "my-MM",
    "32": "nb-NO",
    "33": "nl-NL",
    "34": "pl-PL",
    "35": "pt-PT",
    "36": "ro-RO",
    "37": "ru-RU",
    "38": "sl-SL",
    "39": "sq-AL",
    "40": "sv-SE",
    "41": "sw-KE",
    "42": "ta-IN",
    "43": "te-IN",
    "44": "th-TH",
    "45": "tl-PH",
    "46": "tr-TR",
    "47": "ur-PK",
    "48": "vi-VN",
    "49": "zh-CN",
    "50": "zh-TW"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "af-ZA": 0,
    "am-ET": 1,
    "ar-SA": 2,
    "az-AZ": 3,
    "bn-BD": 4,
    "cy-GB": 5,
    "da-DK": 6,
    "de-DE": 7,
    "el-GR": 8,
    "en-US": 9,
    "es-ES": 10,
    "fa-IR": 11,
    "fi-FI": 12,
    "fr-FR": 13,
    "he-IL": 14,
    "hi-IN": 15,
    "hu-HU": 16,
    "hy-AM": 17,
    "id-ID": 18,
    "is-IS": 19,
    "it-IT": 20,
    "ja-JP": 21,
    "jv-ID": 22,
    "ka-GE": 23,
    "km-KH": 24,
    "kn-IN": 25,
    "ko-KR": 26,
    "lv-LV": 27,
    "ml-IN": 28,
    "mn-MN": 29,
    "ms-MY": 30,
    "my-MM": 31,
    "nb-NO": 32,
    "nl-NL": 33,
    "pl-PL": 34,
    "pt-PT": 35,
    "ro-RO": 36,
    "ru-RU": 37,
    "sl-SL": 38,
    "sq-AL": 39,
    "sv-SE": 40,
    "sw-KE": 41,
    "ta-IN": 42,
    "te-IN": 43,
    "th-TH": 44,
    "tl-PH": 45,
    "tr-TR": 46,
    "ur-PK": 47,
    "vi-VN": 48,
    "zh-CN": 49,
    "zh-TW": 50
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
